package com.lq.entity;

import com.alibaba.fastjson.JSON;

import java.io.Serializable;
import java.util.Date;

/**
 * Created by Administrator on 2017/8/14.
 */
public class Emp implements Serializable{

    /**
     * 序列化版本号
     */
    private static final long   serialVersionUID    = 1L;

    /**
     * 实体对应的数据库表名
     */
    public static final String  TABLE_NAME          = "emp";

    /**
     * id
     */
    private String              id;

    /**
     * 姓名
     */
    private String              name;

    /**
     * 年龄
     */
    private Integer             age;

    /**
     * 性别
     */
    private Integer             gender;

    /**
     * 生日
     */
    private Date birthday;

    /**
     * 入职日期
     */
    private Date                hiredate;
    /**
     * 工作
     */
    private String              job;

    /**
     * 爱好
     */
    private String              hobbies;

    /**
     * 方法描述: 获取年龄
     * 初始作者: lq
     * 创建日期: 2017年8月16日-上午9:31:17
     * 开始版本: 1.0.0
     * =================================================
     * 修改记录：
     * 修改作者 日期 修改内容
     * ================================================
     *
     * @return
     *         Integer 年龄
     */
    public Integer getAge() {

        return age;
    }

    /**
     * 方法描述: 获取生日
     * 初始作者: lq
     * 创建日期: 2017年8月16日-上午9:31:40
     * 开始版本: 1.0.0
     * =================================================
     * 修改记录：
     * 修改作者 日期 修改内容
     * ================================================
     *
     * @return
     *         Date 生日
     */
    public Date getBirthday() {

        return birthday;
    }

    /**
     * 方法描述: 获取性别
     * 初始作者: lq
     * 创建日期: 2017年8月16日-上午9:31:57
     * 开始版本: 1.0.0
     * =================================================
     * 修改记录：
     * 修改作者 日期 修改内容
     * ================================================
     *
     * @return
     *         Integer 性别
     */
    public Integer getGender() {

        return gender;
    }

    /**
     * 方法描述: 获取入职日期
     * 初始作者: lq
     * 创建日期: 2017年8月16日-上午9:32:17
     * 开始版本: 1.0.0
     * =================================================
     * 修改记录：
     * 修改作者 日期 修改内容
     * ================================================
     *
     * @return
     *         Date 入职日期
     */
    public Date getHiredate() {

        return hiredate;
    }

    /**
     * 方法描述: 获取爱好
     * 初始作者: lq
     * 创建日期: 2017年8月16日-上午9:32:37
     * 开始版本: 1.0.0
     * =================================================
     * 修改记录：
     * 修改作者 日期 修改内容
     * ================================================
     *
     * @return
     *         String 爱好
     */
    public String getHobbies() {

        return hobbies;
    }

    /**
     * 方法描述: 获取id
     * 初始作者: lq
     * 创建日期: 2017年8月16日-上午9:33:02
     * 开始版本: 1.0.0
     * =================================================
     * 修改记录：
     * 修改作者 日期 修改内容
     * ================================================
     *
     * @return
     *         String id
     */
    public String getId() {

        return id;
    }

    /**
     * 方法描述: 获取工作
     * 初始作者: lq
     * 创建日期: 2017年8月16日-上午9:33:20
     * 开始版本: 1.0.0
     * =================================================
     * 修改记录：
     * 修改作者 日期 修改内容
     * ================================================
     *
     * @return
     *         String 工作
     */
    public String getJob() {

        return job;
    }

    /**
     * 方法描述: 获取姓名
     * 初始作者: lq
     * 创建日期: 2017年8月16日-上午9:33:37
     * 开始版本: 1.0.0
     * =================================================
     * 修改记录：
     * 修改作者 日期 修改内容
     * ================================================
     *
     * @return
     *         String 姓名
     */
    public String getName() {

        return name;
    }

    /**
     * 方法描述: 设置年龄
     * 初始作者: lq
     * 创建日期: 2017年8月16日-上午9:33:54
     * 开始版本: 1.0.0
     * =================================================
     * 修改记录：
     * 修改作者 日期 修改内容
     * ================================================
     *
     * @param age
     *            年龄
     */
    public void setAge(Integer age) {

        this.age = age;
    }

    /**
     * 方法描述: 设置生日
     * 初始作者: lq
     * 创建日期: 2017年8月16日-上午9:34:09
     * 开始版本: 1.0.0
     * =================================================
     * 修改记录：
     * 修改作者 日期 修改内容
     * ================================================
     *
     * @param birthday
     *            生日
     */
    public void setBirthday(Date birthday) {

        this.birthday = birthday;
    }

    /**
     * 方法描述: 设置性别
     * 初始作者: lq
     * 创建日期: 2017年8月16日-上午9:34:30
     * 开始版本: 1.0.0
     * =================================================
     * 修改记录：
     * 修改作者 日期 修改内容
     * ================================================
     *
     * @param gender
     *            性别
     */
    public void setGender(Integer gender) {

        this.gender = gender;
    }

    /**
     * 方法描述: 设置入职日期
     * 初始作者: lq
     * 创建日期: 2017年8月16日-上午9:34:56
     * 开始版本: 1.0.0
     * =================================================
     * 修改记录：
     * 修改作者 日期 修改内容
     * ================================================
     *
     * @param hiredate
     *            入职日期
     */
    public void setHiredate(Date hiredate) {

        this.hiredate = hiredate;
    }

    /**
     * 方法描述: 设置爱好
     * 初始作者: lq
     * 创建日期: 2017年8月16日-上午9:35:16
     * 开始版本: 1.0.0
     * =================================================
     * 修改记录：
     * 修改作者 日期 修改内容
     * ================================================
     *
     * @param hobbies
     *            爱好
     */
    public void setHobbies(String hobbies) {

        this.hobbies = hobbies;
    }

    /**
     * 方法描述: 设置id
     * 初始作者: lq
     * 创建日期: 2017年8月16日-上午9:35:37
     * 开始版本: 1.0.0
     * =================================================
     * 修改记录：
     * 修改作者 日期 修改内容
     * ================================================
     *
     * @param id
     *            id
     */
    public void setId(String id) {

        this.id = id;
    }

    /**
     * 方法描述: 设置工作
     * 初始作者: lq
     * 创建日期: 2017年8月16日-上午9:35:53
     * 开始版本: 1.0.0
     * =================================================
     * 修改记录：
     * 修改作者 日期 修改内容
     * ================================================
     *
     * @param job
     *            工作
     */
    public void setJob(String job) {

        this.job = job;
    }

    /**
     * 方法描述: 设置姓名
     * 初始作者: lq
     * 创建日期: 2017年8月16日-上午9:36:10
     * 开始版本: 1.0.0
     * =================================================
     * 修改记录：
     * 修改作者 日期 修改内容
     * ================================================
     *
     * @param name
     *            姓名
     */
    public void setName(String name) {

        this.name = name;
    }

    /**
     * 方法描述: 重写toString()方法
     * 初始作者: lq
     * 创建日期: 2016年3月22日-下午2:14:07
     * 开始版本: 1.0.0
     * =================================================
     * 修改记录：
     * 修改作者 日期 修改内容
     * ================================================
     */
    @Override
    public String toString() {

        return JSON.toJSONString(this);
    }

}
